# Conceptos

## Bases de datos relacionales

Conjunto de tablas de datos que se relacionan entre sí a través de columnas que tienen valores comunes y que nosotros llamaremos "claves"

# SQL: Structured Query Language

- **Lenguaje de Programación**: Sintaxis propia, interpretado por un ordenador para dar respuesta a unas instrucciones  
- **Creado en 1970**, en IBM  
- Es el estándar de facto para la interacción con bases de datos relacionales

- Python tiene librerías que permiten interactuar con las BBDD de esos gestores  

- Veremos: Sqlite3 y MySQL (sqlite3 y pymysql)  

- Les lanzaremos consultas (queries) en SQL y funcionaremos igual que si estuviéramos usando sus intérpretes

## SQL: Components Clave  

- SELECT  
- INSERT  
- UPDATE  
- DELETE

### Select

SELECT campo o campos a seleccionar  
FROM tabla o tablas de las que seleccionarios  
WHERE condiciones a aplicar  
ORDER BY campo o campos por los que ordenar el resultado  
LIMIT número de registros que quiero recuperar si no quiero todos los posibles

### Ejemplo:
```sql
SELECT * FROM Empleados;

ld_Empleado    Nombre    ld_Departamento
1              Ana       10
2              Carlos    20
3              Diana     10
4              Eduardo   30

```sql
SELECT nombre, id_departamento
FROM Empleados
WHERE id_departamento = 10;

Devuelve nombre e id_departamento de los empleados en el departamento 10:

Nombre    Id_Departamento
Ana       10
Diana     10

### SQL: SELECT Ejemplo

```sql
SELECT nombre, id_departamento 
FROM Empleados
WHERE id_departamento = 10
ORDER BY nombre DESC;

Devuelve nombre e id_departamento de los empleados en el departamento 10 ordenados por nombre de forma descendente:

### Ejemplo SQL con filtrado y ordenación

```sql
SELECT nombre, id_departamento
FROM Empleados
WHERE id_departamento != 30
ORDER BY nombre DESC
LIMIT 2;

Resultado:
Devuelve nombre e id_departamento de los empleados que no son del departamento 30, ordenados por nombre de forma descendente (mostrando sólo los 2 primeros):

## Insert

### SQL: INSERT ejemplo

```sql
INSERT INTO Empleados (id_empleado, nombre, id_departamento) 
VALUES (5, 'Roberto', 30);

Se ha insertado el nuevo empleado Roberto en el departamento 30

La tabla muestra ahora los 5 empleados con sus datos completos

| id_empleado | nombre  | id_departamento |
|-------------|---------|-----------------|
| 1           | Ana     | 10              |
| 2           | Carlos  | 20              |
| 3           | Diana   | 10              |
| 4           | Eduardo | 30              |
| 5           | Roberto | 30              |

## Update

### SQL: UPDATE ejemplo

Nos permite actualizar o establecer datos que le demos teniendo en cosnideracióon una condición

```sql
UPDATE empleados
SET id_departamento = 3
WHERE id_empleado = 3;

| id_empleado | nombre  | id_departamento |
|-------------|---------|-----------------|
| 1           | Ana     | 10              |
| 2           | Carlos  | 20              |
| 3           | Diana   | 3               |
| 4           | Eduardo | 30              |
| 5           | Roberto | 30              |

## Delete

Nos permite borrar los registos de una tabla siempre y cuando se cumpla la condición que establezcamos, importante poner el where o sino puede que se cargue toda la tabla

```sql
DELETE from empleados
WHERE id_empleado = 3;